//!================================================= First Task ==========================================================
//?Задача черги до каси.Дається масив і параметр.МАСИВ це числа(покупці) кожне число значить скільки покупець проведе часу
//?на касі.Другий параметр це ЧИСЛО кількість касс. ПОТРІБНО Рівномірно розставити покупців по касам в форматі об'єкта.
//?Ключ об'єкта це номер касси а числа з масиву це покупці(значення об'єкту).

function fn(arr, count) {
    const obj = {};
    for(let i = 1; i <= count; i++) {
        obj[i] = 0;
    }
    for(let i = 0; i < arr.length; i++) {
        if() {
            
        }
    }
}

console.log(fn([12, 3, 5, 6, 2, 15, 7], 2));


