//!=============================================== First Task ======================================================
// let question = prompt("Введіть будь ласка ваш емейл");
// console.log(question);

// if(question !== null){
//     if(question.includes("@") && question.includes(".")){  //Перевірка чи в полі prompt введенні знаки @ та .
//         console.log("Перевірка успішна!");
//     }else {
//         console.log("Перевірка не успішна");
//     }
// }

//!===================================== Second Task =========================================
